{
  "Id": "7ae25451-366d-49cc-a49d-eba03d147db0",
  "Name": "Creates an Azure resource group",
  "Description": "The New-AzureRmResourceGroup cmdlet creates an Azure resource group and returns an object that represents the resource group.",
  "ActionType": "Octopus.AzurePowerShell",
  "Version": 26,
  "Properties": {
    "Octopus.Action.Azure.AccountId": "#{AzureAccount}",
    "Octopus.Action.Script.ScriptSource": "Inline",
    "Octopus.Action.Script.ScriptBody": "    New-AzureRMResourceGroup -Name $Name -Location $Location -Tag ($Tag | ConvertFrom-StringData) -Force\n\n",
    "Octopus.Action.Package.FeedId": null,
    "Octopus.Action.Script.ScriptFileName": null,
    "Octopus.Action.Package.PackageId": null,
    "Octopus.Action.Script.Syntax": "PowerShell"
  },
  "Parameters": [
    {
      "Id": "a5398248-3866-4e86-bfcd-6f6091199839",
      "Name": "Name",
      "Label": "Name",
      "HelpText": "Required: Specifies a name for the resource group. This parameter is required. The resource name must be unique in the subscription.You can use -Name or its alias, -ResourceGroupName.If a resource group with that name already exists, the command prompts you for confirmation before replacing the existing resource group. To suppress the confirmation prompt, use the Force parameter.",
      "DefaultValue": null,
      "DisplaySettings": {
        "Octopus.ControlType": "SingleLineText"
      }
    },
    {
      "Id": "ddbea94f-8053-4da7-aaea-c71e31be38a5",
      "Name": "Location",
      "Label": "Location",
      "HelpText": "Required: Specifies the location of the resource group. This parameter is required. Enter an Azure data center location, such as \"West US\" or \"Southeast Asia\".You can place a resource group in any location. The resource group does not have to be in the same location your Azure subscription or the same location as its resources. Resource groups can contain resources from different locations. To determine which location support each resource type, use the Get-AzureRmResourceProvider with the ProviderNamespace parameter cmdlet.",
      "DefaultValue": null,
      "DisplaySettings": {
        "Octopus.ControlType": "SingleLineText"
      }
    },
    {
      "Id": "c2ce713e-e157-4f4a-b28d-c7aa6186ede4",
      "Name": "Tag",
      "Label": "Tag",
      "HelpText": "Optional: Applies the specified tags to the new resource group. Enter new tags or predefined tags that you created by using the New-AzureRmTag cmdlet.A \"tag\" is a name-value pair that you can apply to resources and resource groups. Use tags to categorize your resources, such as by department or cost center, or to track notes or comments about the resources. After you assign tags to resources, you can use the Tag parameters of Find-AzureRmResource and Find-AzureRmResourceGroup to search for resources and groups by tag name or name and value.Every tag must have a name and an optional value. To specify a new tag, FY2015=$null Department=\"IT\" one in each line. To get your predefined tags, use the Get-AzureRmTag cmdlet.",
      "DefaultValue": null,
      "DisplaySettings": {
        "Octopus.ControlType": "MultiLineText"
      }
    },
    {
      "Id": "18d18732-972c-446a-a6da-912866332c02",
      "Name": "AzureAccount",
      "Label": "AzureAccount",
      "HelpText": null,
      "DefaultValue": null,
      "DisplaySettings": {
        "Octopus.ControlType": "SingleLineText"
      }
    }
  ],
  "LastModifiedOn": "2016-10-19T04:14:30.085+00:00",
  "LastModifiedBy": "mani0070",
  "$Meta": {
    "ExportedAt": "2016-10-19T04:14:30.085+00:00",
    "OctopusVersion": "3.4.12",
    "Type": "ActionTemplate"
  },
  "Category": "azure"
}